In [1]:
import pandas as pd

# Créer un DataFrame d'exemple
data = {
    "Etudiant": ["Alice", "Bob", "Charlie", "Alice", "Bob", "Charlie"],
    "Matière": ["Maths", "Maths", "Maths", "Physique", "Physique", "Physique"],
    "Note": [15, 14, 16, 12, 15, 14],
}
df = pd.DataFrame(data)

In [6]:
df.groupby(['Etudiant', 'Matière']).agg({'Note': 'mean'})

                   Note
Etudiant Matière
Alice    Maths     15.0
         Physique  12.0
Bob      Maths     14.0
         Physique  15.0
Charlie  Maths     16.0
         Physique  14.0

In [7]:
import pandas as pd

# Créer un DataFrame d'exemple
data = {
    'Vendeur': ['Alice', 'Bob', 'Charlie', 'Alice', 'Bob', 'Charlie'],
    'Produit': ['Pommes', 'Bananes', 'Pommes', 'Bananes', 'Pommes', 'Bananes'],
    'Quantité': [3, 2, 4, 3, 3, 2]
}
df = pd.DataFrame(data)

In [9]:
table = df.pivot_table(values='Quantité', index='Vendeur',
                       columns='Produit', aggfunc='sum')
table

Produit  Bananes  Pommes
Vendeur
Alice          3       3
Bob            2       3
Charlie        2       4

In [10]:
import pandas as pd

# Créer un DataFrame d'exemple
data = {
    'Etudiant': ['Alice', 'Bob', 'Charlie'],
    'Note': [15, 14, 16]
}
df = pd.DataFrame(data)

In [12]:
df["Note"] = df["Note"].apply(lambda x: x + 1)
df

  Etudiant  Note
0    Alice    17
1      Bob    16
2  Charlie    18

In [14]:
def ajouter_un(x):
    return x + 1


df['Note'] = df['Note'].apply(ajouter_un)
df

  Etudiant  Note
0    Alice    19
1      Bob    18
2  Charlie    20